## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ab-azure-kubernetes.azurerm_kubernetes_cluster.app_aks will be created
  + resource "azurerm_kubernetes_cluster" "app_aks" {
      + current_kubernetes_version          = (known after apply)
      + dns_prefix_private_cluster          = "ab-aks.dev"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.30"
      + local_account_disabled              = true
      + location                            = "eastus"
      + name                                = "ab-dev-app-aks-01"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "ab-dev-app-rg-01"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "app_id"      = "12345"
          + "app_name"    = "dev-ab-app"
          + "app_owner"   = "tburgebeckley@gmail.com"
          + "env"         = "dev"
          + "location"    = "eastus"
          + "module_name" = "ab-azure-kubernetes"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "7fde10cc-63c0-4ef5-8e66-4b5533883247",
              + "dee70b29-0305-47b4-98eb-aaf0ed65fbb8",
            ]
          + azure_rbac_enabled     = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + auto_scaling_enabled        = true
          + kubelet_disk_type           = (known after apply)
          + max_count                   = 1
          + max_pods                    = (known after apply)
          + min_count                   = 1
          + name                        = "ab-aksdefpool-01"
          + node_count                  = 1
          + node_labels                 = (known after apply)
          + orchestrator_version        = (known after apply)
          + os_disk_size_gb             = (known after apply)
          + os_disk_type                = "Managed"
          + os_sku                      = (known after apply)
          + scale_down_mode             = "Delete"
          + temporary_name_for_rotation = "tempnodepool"
          + type                        = "VirtualMachineScaleSets"
          + ultra_ssd_enabled           = false
          + vm_size                     = "Standard_DS2_v2"
          + vnet_subnet_id              = (known after apply)
          + workload_runtime            = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile (known after apply)

      + windows_profile (known after apply)
    }

  # module.ab-azure-kubernetes.azurerm_resource_group.app_rg will be created
  + resource "azurerm_resource_group" "app_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "ab-dev-app-rg-01"
      + tags     = {
          + "app_id"      = "12345"
          + "app_name"    = "dev-ab-app"
          + "app_owner"   = "tburgebeckley@gmail.com"
          + "env"         = "dev"
          + "location"    = "eastus"
          + "module_name" = "ab-azure-kubernetes"
        }
    }

  # module.ab-azure-kubernetes.azurerm_subnet.app_subnets["subnet1"] will be created
  + resource "azurerm_subnet" "app_subnets" {
      + address_prefixes                              = [
          + "10.0.0.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "aks-defpool-snet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "ab-dev-app-rg-01"
      + virtual_network_name                          = "ab-dev-app-vnet-01"
    }

  # module.ab-azure-kubernetes.azurerm_virtual_network.app_vnet will be created
  + resource "azurerm_virtual_network" "app_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "ab-dev-app-vnet-01"
      + resource_group_name = "ab-dev-app-rg-01"
      + subnet              = (known after apply)
      + tags                = {
          + "app_id"      = "12345"
          + "app_name"    = "dev-ab-app"
          + "app_owner"   = "tburgebeckley@gmail.com"
          + "env"         = "dev"
          + "location"    = "eastus"
          + "module_name" = "ab-azure-kubernetes"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>